; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=7, locations=10, density=0.26666666666666666, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=41, seed=82

(define (problem transport-41)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l5)
    (at p3 l3)
    (at p4 l1)
    (at p5 l7)
    (at p6 l8)
    (at p7 l10)
    (at v1 l2)
    (at v2 l4)
    (at v3 l5)
    (at v4 l9)
    (road l7 l4)
    (road l2 l4)
    (road l4 l9)
    (road l7 l10)
    (road l5 l4)
    (road l9 l6)
    (road l6 l1)
    (road l10 l7)
    (road l4 l2)
    (road l2 l3)
    (road l4 l5)
    (road l8 l9)
    (road l9 l8)
    (road l1 l6)
    (road l3 l2)
    (road l6 l9)
    (road l4 l7)
    (road l9 l4)
    (road l3 l5)
    (road l5 l3)
    (road l8 l10)
    (road l10 l8)
    (road l1 l7)
    (road l7 l1)
    )
 (:goal  (and 
    (at p1 l8)
    (at p2 l7)
    (at p3 l1)
    (at p4 l2)
    (at p5 l9)
    (at p6 l7)
    (at p7 l6))))

; plan
1. (pick-up v3 l5 p2 c1 c2)
   deleted: (at p2 l5) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 7
2. (drive v3 l5 l3)
   deleted: (at v3 l5)
   added: (at v3 l3)
   goals met: 0 of 7
3. (pick-up v3 l3 p3 c0 c1)
   deleted: (at p3 l3) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 0 of 7
4. (drive v3 l3 l2)
   deleted: (at v3 l3)
   added: (at v3 l2)
   goals met: 0 of 7
5. (drive v3 l2 l4)
   deleted: (at v3 l2)
   added: (at v3 l4)
   goals met: 0 of 7
6. (drive v3 l4 l7)
   deleted: (at v3 l4)
   added: (at v3 l7)
   goals met: 0 of 7
7. (drop v3 l7 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l7) (capacity v3 c1)
   goals met: 1 of 7
8. (drive v3 l7 l1)
   deleted: (at v3 l7)
   added: (at v3 l1)
   goals met: 1 of 7
9. (drop v3 l1 p3 c1 c2)
   deleted: (in p3 v3) (capacity v3 c1)
   added: (at p3 l1) (capacity v3 c2)
   goals met: 2 of 7
10. (pick-up v3 l1 p4 c1 c2)
   deleted: (at p4 l1) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 2 of 7
11. (drive v3 l1 l7)
   deleted: (at v3 l1)
   added: (at v3 l7)
   goals met: 2 of 7
12. (pick-up v3 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 2 of 7
13. (drive v3 l7 l4)
   deleted: (at v3 l7)
   added: (at v3 l4)
   goals met: 2 of 7
14. (drive v3 l4 l2)
   deleted: (at v3 l4)
   added: (at v3 l2)
   goals met: 2 of 7
15. (drop v3 l2 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l2) (capacity v3 c1)
   goals met: 3 of 7
16. (drive v3 l2 l3)
   deleted: (at v3 l2)
   added: (at v3 l3)
   goals met: 3 of 7
17. (pick-up v3 l3 p1 c0 c1)
   deleted: (at p1 l3) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 3 of 7
18. (drive v3 l3 l2)
   deleted: (at v3 l3)
   added: (at v3 l2)
   goals met: 3 of 7
19. (drive v3 l2 l4)
   deleted: (at v3 l2)
   added: (at v3 l4)
   goals met: 3 of 7
20. (drive v3 l4 l9)
   deleted: (at v3 l4)
   added: (at v3 l9)
   goals met: 3 of 7
21. (drop v3 l9 p5 c0 c1)
   deleted: (in p5 v3) (capacity v3 c0)
   added: (at p5 l9) (capacity v3 c1)
   goals met: 4 of 7
22. (drive v3 l9 l8)
   deleted: (at v3 l9)
   added: (at v3 l8)
   goals met: 4 of 7
23. (drop v3 l8 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l8) (capacity v3 c2)
   goals met: 5 of 7
24. (pick-up v3 l8 p6 c1 c2)
   deleted: (at p6 l8) (capacity v3 c2)
   added: (in p6 v3) (capacity v3 c1)
   goals met: 5 of 7
25. (drive v3 l8 l10)
   deleted: (at v3 l8)
   added: (at v3 l10)
   goals met: 5 of 7
26. (pick-up v3 l10 p7 c0 c1)
   deleted: (at p7 l10) (capacity v3 c1)
   added: (in p7 v3) (capacity v3 c0)
   goals met: 5 of 7
27. (drive v3 l10 l7)
   deleted: (at v3 l10)
   added: (at v3 l7)
   goals met: 5 of 7
28. (drop v3 l7 p6 c0 c1)
   deleted: (in p6 v3) (capacity v3 c0)
   added: (at p6 l7) (capacity v3 c1)
   goals met: 6 of 7
29. (drive v3 l7 l1)
   deleted: (at v3 l7)
   added: (at v3 l1)
   goals met: 6 of 7
30. (drive v3 l1 l6)
   deleted: (at v3 l1)
   added: (at v3 l6)
   goals met: 6 of 7
31. (drop v3 l6 p7 c1 c2)
   deleted: (in p7 v3) (capacity v3 c1)
   added: (at p7 l6) (capacity v3 c2)
   goals met: 7 of 7
